In [143]:
import pandas as pd
import numpy as np
import matplotlib

In [144]:
#Read the income return on the type of degree CSV
Degrees_Payback = pd.read_csv('degrees-that-pay-back.csv')
Degree_df = pd.DataFrame(Degrees_Payback)

#Ready the salary averages based on college type
Salary_By_College = pd.read_csv('salaries-by-college-type.csv')
College_Salary_df = pd.DataFrame(Salary_By_College)

#Read the income based upon region
Salary_By_Region = pd.read_csv('salaries-by-region.csv')
Region_Salary_df = pd.DataFrame(Salary_By_Region)

In [145]:
Region_Salary_df.head()

,School Name,Region,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Stanford University,California,"$70,400.00","$129,000.00","$68,400.00","$93,100.00","$184,000.00","$257,000.00"
1,California Institute of Technology (CIT),California,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN
2,Harvey Mudd College,California,"$71,800.00","$122,000.00",NaN,"$96,000.00","$180,000.00",NaN
3,"University of California, Berkeley",California,"$59,900.00","$112,000.00","$59,500.00","$81,000.00","$149,000.00","$201,000.00"
4,Occidental College,California,"$51,900.00","$105,000.00",NaN,"$54,800.00","$157,000.00",NaN

In [146]:
#Rename the columns
Region_Salary_df.columns = ['School Name', 'Region', 'Starting_Mid', 'Mid_Sal', 'Mid_10th', 'Mid_25th', 'Mid_75th', 'Mid_90th']
Region_Salary_df2 = Region_Salary_df.fillna(0)
Region_Salary_df2.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
0,Stanford University,California,"$70,400.00","$129,000.00","$68,400.00","$93,100.00","$184,000.00","$257,000.00"
1,California Institute of Technology (CIT),California,"$75,500.00","$123,000.00",0,"$104,000.00","$161,000.00",0
2,Harvey Mudd College,California,"$71,800.00","$122,000.00",0,"$96,000.00","$180,000.00",0
3,"University of California, Berkeley",California,"$59,900.00","$112,000.00","$59,500.00","$81,000.00","$149,000.00","$201,000.00"
4,Occidental College,California,"$51,900.00","$105,000.00",0,"$54,800.00","$157,000.00",0

In [147]:
#Change objects in the DF to integers
Columns = ['Starting_Mid', 'Mid_Sal', 'Mid_10th', 'Mid_25th', 'Mid_75th', 'Mid_90th']
for column in Columns:
    Region_Salary_df2[column] = Region_Salary_df2[column].str.replace("$","")
    Region_Salary_df2[column] = Region_Salary_df2[column].str.replace(",","")
    Region_Salary_df2[column] = pd.to_numeric(Region_Salary_df2[column])

Region_Salary_df2.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
0,Stanford University,California,70400.0,129000.0,68400.0,93100.0,184000.0,257000.0
1,California Institute of Technology (CIT),California,75500.0,123000.0,NaN,104000.0,161000.0,NaN
2,Harvey Mudd College,California,71800.0,122000.0,NaN,96000.0,180000.0,NaN
3,"University of California, Berkeley",California,59900.0,112000.0,59500.0,81000.0,149000.0,201000.0
4,Occidental College,California,51900.0,105000.0,NaN,54800.0,157000.0,NaN

In [148]:
Cali_Region = Region_Salary_df2.loc[Region_Salary_df2["Region"] == "California", :]
Cali_Region.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
0,Stanford University,California,70400.0,129000.0,68400.0,93100.0,184000.0,257000.0
1,California Institute of Technology (CIT),California,75500.0,123000.0,NaN,104000.0,161000.0,NaN
2,Harvey Mudd College,California,71800.0,122000.0,NaN,96000.0,180000.0,NaN
3,"University of California, Berkeley",California,59900.0,112000.0,59500.0,81000.0,149000.0,201000.0
4,Occidental College,California,51900.0,105000.0,NaN,54800.0,157000.0,NaN

In [149]:
Cali_Region['Starting_Mid'].astype(object).astype(float).mean()

51032.142857142855

In [160]:
# Use pd.to_numeric() method to convert the datatype of the Amount column
#Cali_Region['Starting_Mid'] = df.loc.to_numeric(Cali_Region['Starting_Mid'])

In [151]:
Western_Region = Region_Salary_df2.loc[Region_Salary_df2["Region"] == "Western", :]
Western_Region.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
28,Colorado School of Mines,Western,58100.0,106000.0,62200.0,87900.0,142000.0,201000.0
29,University of Colorado - Boulder (UCB),Western,47100.0,97600.0,51600.0,69000.0,128000.0,187000.0
30,New Mexico Institute of Mining and Technology ...,Western,51000.0,93400.0,NaN,67400.0,123000.0,NaN
31,Brigham Young University (BYU),Western,49400.0,88600.0,50600.0,68500.0,119000.0,164000.0
32,University of Arizona,Western,47500.0,86100.0,44800.0,61700.0,117000.0,160000.0

In [152]:
Western_Region.describe()

,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
count,42.000000,42.000000,34.000000,42.000000,42.000000,34.000000
mean,44414.285714,78200.000000,42985.294118,56580.952381,106026.190476,143823.529412
std,3935.180377,9743.740955,5473.192651,9008.078707,14107.169247,20338.753259
min,37300.000000,50600.000000,35400.000000,31800.000000,78400.000000,110000.000000
25%,42050.000000,72600.000000,39200.000000,52650.000000,99225.000000,131250.000000
50%,44850.000000,78850.000000,41700.000000,56650.000000,104000.000000,142500.000000
75%,46575.000000,83125.000000,46000.000000,60025.000000,113000.000000,150000.000000
max,58100.000000,106000.000000,62200.000000,87900.000000,148000.000000,201000.000000

In [153]:
Northeastern_Region = Region_Salary_df2.loc[Region_Salary_df2["Region"] == "Northeastern", :]
Northeastern_Region.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
220,Dartmouth College,Northeastern,58000.0,134000.0,63100.0,90200.0,234000.0,321000.0
221,Princeton University,Northeastern,66500.0,131000.0,68900.0,100000.0,190000.0,261000.0
222,Massachusetts Institute of Technology (MIT),Northeastern,72200.0,126000.0,76800.0,99200.0,168000.0,220000.0
223,Yale University,Northeastern,59100.0,126000.0,58000.0,80600.0,198000.0,326000.0
224,Harvard University,Northeastern,63400.0,124000.0,54800.0,86200.0,179000.0,288000.0

In [154]:
Northeastern_Region.describe()

,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
count,100.000000,100.000000,82.000000,100.000000,100.000000,82.000000
mean,48496.000000,91352.000000,49101.219512,65479.000000,129576.000000,181926.829268
std,7159.001115,15103.023177,9873.714874,11808.816215,25988.995807,42439.144663
min,36900.000000,62600.000000,32800.000000,42800.000000,85700.000000,117000.000000
25%,43150.000000,80825.000000,42875.000000,57325.000000,111500.000000,151500.000000
50%,47000.000000,88700.000000,47050.000000,62800.000000,125500.000000,173500.000000
75%,52825.000000,101250.000000,53825.000000,72050.000000,143000.000000,197250.000000
max,72200.000000,134000.000000,80000.000000,100000.000000,234000.000000,326000.000000

In [155]:
Midwestern_Region = Region_Salary_df2.loc[Region_Salary_df2["Region"] == "Midwestern", :]
Midwestern_Region.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
70,University of Notre Dame,Midwestern,56300.0,116000.0,66400.0,85100.0,163000.0,235000.0
71,University Of Chicago,Midwestern,53400.0,113000.0,62200.0,83300.0,174000.0,255000.0
72,Carleton College,Midwestern,47500.0,103000.0,NaN,69400.0,141000.0,NaN
73,Illinois Institute of Technology (IIT),Midwestern,56000.0,97800.0,56100.0,77400.0,121000.0,165000.0
74,Case Western Reserve University,Midwestern,56200.0,96500.0,54900.0,76500.0,123000.0,168000.0

In [156]:
Midwestern_Region.describe()

,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
count,71.000000,71.000000,64.000000,71.000000,71.000000,64.000000
mean,44225.352113,78180.281690,43076.562500,57026.760563,107594.366197,147689.062500
std,5068.240560,12997.687923,8438.267749,10379.911337,19125.501953,28818.331452
min,35300.000000,43900.000000,25600.000000,32200.000000,60900.000000,85700.000000
25%,41100.000000,70850.000000,37850.000000,49650.000000,95550.000000,128000.000000
50%,43100.000000,77800.000000,40600.000000,54400.000000,105000.000000,143000.000000
75%,46250.000000,84700.000000,46275.000000,61800.000000,119000.000000,162250.000000
max,57100.000000,116000.000000,71500.000000,85100.000000,174000.000000,255000.000000

In [157]:
Southern_Region = Region_Salary_df2.loc[Region_Salary_df2["Region"] == "Southern", :]
Southern_Region.head()

,School Name,Region,Starting_Mid,Mid_Sal,Mid_10th,Mid_25th,Mid_75th,Mid_90th
141,Rice University,Southern,64000.0,110000.0,55900.0,82100.0,141000.0,216000.0
142,Georgetown University,Southern,55000.0,110000.0,60300.0,85800.0,174000.0,248000.0
143,Duke University,Southern,58900.0,106000.0,56000.0,77400.0,149000.0,218000.0
144,Georgia Institute of Technology,Southern,58300.0,106000.0,67200.0,85200.0,137000.0,183000.0
145,Washington and Lee University,Southern,53600.0,104000.0,NaN,82800.0,146000.0,NaN

In [158]:
# Minor Data Munging to Re-Format the Data Frames

#Mean Reformatted
#South_Mean_Reformat = South_df.reset_index()
#Southern_Pivot = South_Mean_Reformat.pivot(index='Starting_Mid', columns='Region')['School Name']

# Preview that Reformatting worked
#Southern_Pivot.head()

In [159]:
# Minor Data Munging to Re-Format the Data Frames

#Mean Reformatted
#Southern_Region_Reformat = Southern_Region.reset_index()
#Southern_Pivot = Southern_Region_Reformat.pivot(index='School Name', columns='Region')['Starting_Mid']

# Preview that Reformatting worked
#Southern_Pivot.head()